Revit 2026 API

# ToggleButtonData Properties

---

The ToggleButtonData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AssemblyName | The assembly path of the button.(Inherited from PushButtonData) |
|  | AvailabilityClassName | The full class name for the class providing the entry point to decide availability of this push button. (Inherited from PushButtonData) |
|  | ClassName | The name of the class containing the implementation for the command. (Inherited from PushButtonData) |
|  | Image | The image of the button.(Inherited from ButtonData) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ItemData) |
|  | LargeImage | The large image of the button.(Inherited from ButtonData) |
|  | LongDescription | Long description of the command tooltip (Inherited from RibbonItemData) |
|  | Name | The internal name of the item. (Inherited from ItemData) |
|  | Text | The user-visible text of the button.(Inherited from ButtonData) |
|  | ToolTip | The tooltip of item. (Inherited from ItemData) |
|  | ToolTipImage | The image to show as a part of the button extended tooltip (Inherited from RibbonItemData) |

#### Reference

ToggleButtonData Class

Autodesk.Revit.UI Namespace